DeviceRegistryEvents 
| where Timestamp > ago(1d)
| where ActionType == "RegistryValueSet"
| where DeviceId != "1586d74a9f37323d27f7e29ec1a370df6b813191"
| where RegistryKey startswith ("HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Defender\\Exclusions") or RegistryKey startswith ("HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Defender\\Windows Defender Exploit Guard\\ASR\\ASROnlyExclusions")
| project Timestamp, DeviceId, DeviceName, ExcludedFromDefender=RegistryValueName, ReportId
