DeviceRegistryEvents
| where Timestamp > ago(10h)
| where RegistryValueName == "DisableRealtimeMonitoring"
| where RegistryValueData == "1"
| where DeviceId != "1586d74a9f37323d27f7e29ec1a370df6b813191"
