let ip = '13.74.111.192'; // IP to search for
let timeframe = ago(10d); // Time range
let tables = dynamic([
  "IdentityLogonEvents", "IdentityQueryEvents", "IdentityDirectoryEvents", "EmailEvents", 
  "UrlClickEvents", "DeviceNetworkEvents", "DeviceFileEvents", "DeviceLogonEvents", 
  "DeviceEvents", "BehaviorAnalytics", "CloudAppEvents", "AADSpnSignInEventsBeta", 
  "AADSignInEventsBeta", "AADNonInteractiveUserSignInLogs", "AADServicePrincipalSignInLogs", 
  "AADUserRiskEvents", "SigninLogs", "OfficeActivity", "AzureActivity", 
  "MicrosoftGraphActivityLogs", "SecurityEvent", "SecurityAlert"
]);
union isfuzzy=true
  IdentityLogonEvents,
  IdentityQueryEvents,
  IdentityDirectoryEvents,
  EmailEvents,
  UrlClickEvents,
  DeviceNetworkEvents,
  DeviceFileEvents,
  DeviceLogonEvents,
  DeviceEvents,
  BehaviorAnalytics,
  CloudAppEvents,
  AADSpnSignInEventsBeta,
  AADSignInEventsBeta,
  AADNonInteractiveUserSignInLogs,
  AADServicePrincipalSignInLogs,
  AADUserRiskEvents,
  SigninLogs,
  OfficeActivity,
  AzureActivity,
  MicrosoftGraphActivityLogs,
  SecurityEvent,
  SecurityAlert
| where TimeGenerated >= timeframe
| where 
    LocalIP == ip or 
    FileOriginIP == ip or 
    RequestSourceIP == ip or 
    SenderIPv4 == ip or 
    SenderIPv6 == ip or 
    IPAddress == ip or 
    SourceIPAddress == ip or 
    ClientIP == ip or 
    RemoteIP == ip or 
    DestinationIPAddress == ip or 
    CallerIpAddress == ip or 
    tostring(parse_json(ExtendedProperties)["Client IP Address"]) == ip or 
    tostring(IpAddress) == ip
