let BlockList = (externaldata(ip:string)
[@"https://feodotracker.abuse.ch/downloads/ipblocklist_recommended.txt"]
with(format="txt")
| distinct ip
| where ip matches regex "(^(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$)"
);
UrlClickEvents
| where Timestamp > ago(24h)
| where IPAddress in (BlockList)
